kristiangoystdal/Audio_Watermark_Generator/STM32/Core/Src/main.c
/* USER CODE END 0 */

/**
 * @brief  The application entry point.
 * @retval int
 */
int main(void) {

  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */

  /* MCU Configuration--------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick.
   */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

  /* Initialize all configured peripherals */
  MX_GPIO_Init();
  MX_ADC1_Init();
  MX_DAC1_Init();
  MX_I2C2_Init();
  MX_SPI1_Init();
  MX_TIM2_Init();
  MX_TIM6_Init();
  MX_USART2_UART_Init();
  /* USER CODE BEGIN 2 */

  LOGF("\r\n");
  LOGF("UART boot OK\r\n");
  HAL_Delay(200);

  /* USER CODE END 2 */

  /* Infinite loop */
  /* USER CODE BEGIN WHILE */

  // Read battery voltage
  is_battery_low(&hadc1);

  uint32_t dac_sample_rate = get_dac_sample_rate_hz();
  LOGF("DAC sample rate: %lu Hz\r\n", (unsigned long)dac_sample_rate);

  // Turn on LED to indicate power on
  LED_BlinkStatusCode(STATUS_CODE_OK); // code 0 = "0000" = 4 short blinks

  //-----------------------------------------------------------------------------//
  // Find and set FSK frequencies based on user config and sample count
  // requirements
  //-----------------------------------------------------------------------------//

  freq_pair = find_frequency_pair(dac_sample_rate);

  LOGF("Frequency pair: lower=%u Hz, higher=%u Hz\r\n",
       (unsigned int)freq_pair.lower_freq, (unsigned int)freq_pair.higher_freq);
  LOGF("--------------------------\r\n");

  //-----------------------------------------------------------------------------//
  // Prepare sine wave lookup tables
  //-----------------------------------------------------------------------------//

  if (init_luts_from_freqpair() != 0) {
    LOGF("LUT alloc failed\r\n");
    LOGF("--------------------------\r\n");
    Error_Handler_Code(STATUS_CODE_LUT_ALLOC_FAIL);
  }

  get_sineval_low();
  get_sineval_high();
  get_dc_mid();

  //-----------------------------------------------------------------------------//
  // Set DAC output to mid-level (silence) before starting
  //-----------------------------------------------------------------------------//

  Set_DAC_Output_To_Midlevel();

  //-----------------------------------------------------------------------------//
  // Initialize RTC
  //-----------------------------------------------------------------------------//

  // DS3231_PowerOn();
  // if (HAL_I2C_IsDeviceReady(&hi2c2, DS3231_ADDR, 3, 100) == HAL_OK) {
  //   DS3231_Init();
  //   Set_Time(INITIAL_SEC, INITIAL_MIN, INITIAL_HOUR, INITIAL_DOW,
  //   INITIAL_DOM,
  //            INITIAL_MONTH, INITIAL_YEAR);
  // }
  // Get_Time(&now);
  // LOGF("-------------------------\r\n");

  //-----------------------------------------------------------------------------//
  // Initialize radio
  //-----------------------------------------------------------------------------//

  HAL_Delay(20);
  int8_t init_result = init_radio(RX);
  if (init_result != 0) {
    LOGF("Failed to initialize radio in RX mode, error code: %d\r\n",
         init_result);
    LOGF("--------------------------\r\n");
    Error_Handler_Code(init_result);
  }

  //-----------------------------------------------------------------------------//
  // If RX, set relay to mixing mode
  //-----------------------------------------------------------------------------//

  if (RX) {
    turn_on_relay();
  }

  //-----------------------------------------------------------------------------//
  // Main loop
  //-----------------------------------------------------------------------------//

  LOGF("Entering main loop...\r\n");

  while (1) {

    // 1) Enter STOP mode and wait for wakeup from EXTI (GPIOB Pin 7)
    LOGF("Entering STOP mode...\r\n");
    EnterStopMode();

    // 2) Debounce button
    while (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_7) == GPIO_PIN_RESET) {
    }
    __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_7);

    LOGF("Woke up!\r\n");

    // 3) Check state and either start RX or TX
    if (RX) {
      // RX mode: read from radio and store in string
      read_RX(transmission, sizeof(transmission));
      LOGF("Received transmission: ");
      for (size_t i = 0; i < sizeof(transmission); i++) {
        LOGF("%02X ", transmission[i]);
      }
      LOGF("\r\n");

      // Process received transmission (e.g. parse bytes, convert RSSI to dBm,
      // etc.)
      process_transmission(transmission, &dBm_value);

      LOGF("Processed transmission into %s\r\n", transmission);
      LOGF("dBm value: %d\r\n", dBm_value);

      // Create output string based on received data and dBm value (e.g.
      // "/STR.../DID.../LOC.../TMP.../TIM...")
      char output_str[256] = {0};
      create_string_from_received_data(transmission, dBm_value, output_str,
                                       sizeof(output_str));

      LOGF("Final output string: %s\r\n", output_str);

      // Make bitstream from output string
      make_bitstream_from_string(output_str);
      LOGF("Prepared bitstream from output string.\r\n");
      LOGF("Output string length: %d characters\r\n", (int)strlen(output_str));

      // Calculate active duration based on bitstream length and bit durations
      size_t bitstream_len = strlen(output_str) * 8u;
      calculate_active_duration_ms(bitstream_len);
      uint32_t total_ms = (uint32_t)(total_time * 1000.0f);
      LOGF("Calculated active duration for response: %lu ms\r\n",
           (unsigned long)total_ms);

      // Send transmission over audio
      LOGF("Starting transmission of response over audio...\r\n");
      LED_BlinkStatusCode(STATUS_CODE_STARTING_TRANSMISSION);
      TX_Start();

      // Wait for active window to complete (enters low-power sleep while
      // waiting)
      StartActiveWindowMs((uint32_t)(total_time * 1000.0f));
      while (!active_done) {
        __WFI(); // CPU sleeps while DMA+TIM2+DAC run
      }
      active_done = 0;

      // Stop transmission and go back to sleep
      TX_Stop();

    } else {
      // Send transmission over radio
      LOGF("Starting transmission over radio...\r\n");
      LED_BlinkStatusCode(STATUS_CODE_STARTING_TRANSMISSION);
      start_TX();
    }

    // 4) Check battery voltage and go back to sleep if low
    is_battery_low(&hadc1);

    LOGF("Going back to sleep...\r\n");

    /* USER CODE END WHILE */

